maoravni/Dev/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/fsl_sim_hal.c
/*
 * Copyright (c) 2013 - 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "fsl_sim_hal.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/

/*FUNCTION**********************************************************************
 *
 * Function Name : clock_manager_find_module
 * Description   : An internal function to find the specified clock module 
 * table pointer for specified clock gate module name with instance. 
 * If the clock module with instance is supported, it will return an valid 
 * pointer. Otherwise it will return a null pointer. 
 * 
 *END**************************************************************************/
const sim_clock_gate_module_config_t *clock_manager_find_module(
                                                    sim_clock_gate_module_names_t clockModule,
                                                    uint8_t instance)
{
    uint32_t i = 0;

    /* search through whole name table*/
    while (kSimClockGateModuleConfigTable[i].clockGateModuleName != kSimClockModuleMax)
    {
        /* find only the match with both name and instance*/
        if ( (kSimClockGateModuleConfigTable[i].clockGateModuleName == clockModule) && 
             (kSimClockGateModuleConfigTable[i].deviceInstance == instance) )
        {
            /* return the table pointer*/
            return &kSimClockGateModuleConfigTable[i];
        }
        i++;
    }
    return NULL;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : clock_hal_set_gate
 * Description   : Enable or disable the clock for specified clock module
 * This function will enable/disable the clock for specified clock module and 
 * instance.
 * 
 *END**************************************************************************/
sim_hal_status_t clock_hal_set_gate(sim_clock_gate_module_names_t clockModule, 
                                    uint8_t instance, bool enable)
{
    const sim_clock_gate_module_config_t *table = NULL;
    /* check clock module name*/
    assert(clockModule < kSimClockModuleMax);

    /* find out the content matches with name and instance*/
    table = clock_manager_find_module(clockModule, instance);

    if (table != NULL)
    {
        if (enable)
        {
            /* if matches, execute the set(Enable/Disable) the clock gate*/
            *(uint32_t *)table->scgcRegAddress |= table->deviceMask;
        }
        else
        {
            /* if matches, execute the set(Enable/Disable) the clock gate*/
            *(uint32_t *)table->scgcRegAddress &= ~table->deviceMask;
        }
        return kSimHalSuccess;
    }
    else
    {
        return kSimHalNoSuchModule;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : clock_hal_get_gate
 * Description   : Get the clock enable or disable state
 * This function will get the current clock gate status of the specified clock
 * moudle and instance.
 * 
 *END**************************************************************************/
sim_hal_status_t clock_hal_get_gate(sim_clock_gate_module_names_t clockModule, 
                                    uint8_t instance, bool *isEnabled)
{
    const sim_clock_gate_module_config_t *table = NULL;
    /* check clock module name*/
    assert(clockModule < kSimClockModuleMax);

    /* find out the content matches with name and instance*/
    table = clock_manager_find_module(clockModule, instance);

    if (table != NULL)
    {
        if ((*(uint32_t *)table->scgcRegAddress) & table->deviceMask)
        {
            *isEnabled = true;
        }
        else
        {
            *isEnabled = false;
        }
        return kSimHalSuccess;
    }
    else
    {
        return kSimHalNoSuchModule;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : clock_hal_set_clock_source
 * Description   : Set clock source setting 
 * This function will set the settings for specified clock source. Each clock 
 * source has its clock selection settings. Refer to reference manual for 
 * details of settings for each clock source. Refer to sim_clock_source_names_t 
 * for clock sources.
 * 
 *END**************************************************************************/
sim_hal_status_t clock_hal_set_clock_source(sim_clock_source_names_t clockSource, uint8_t setting)
{
    sim_hal_status_t status = kSimHalSuccess;
    assert(clockSource < kSimClockSourceMax);

    switch (clockSource)
    {
#if FSL_FEATURE_SIM_OPT_HAS_NFCSRC
    case kSimClockNfcSrc:                   /* NFCSRC*/
        BW_SIM_SOPT2_NFCSRC(setting);
        break;
    case kSimClockNfcSel:                   /* NFC_CLKSEL*/
        BW_SIM_SOPT2_NFC_CLKSEL(setting);
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_ESDHCSRC
    case kSimClockEsdhcSrc:                 /* ESDHCSRC*/
        BW_SIM_SOPT2_ESDHCSRC(setting);
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_SDHCSRC
    case kSimClockSdhcSrc:                  /* SDHCSRC*/
        BW_SIM_SOPT2_SDHCSRC(setting);
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_LCDCSRC
    case kSimClockLcdcSrc:                  /* LCDCSRC*/
        BW_SIM_SOPT2_LCDCSRC(setting);
        break;
    case kSimClockLcdcSel:                  /* LCDC_CLKSEL*/
        BW_SIM_SOPT2_LCDC_CLKSEL(setting);
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_TIMESRC
    case kSimClockTimeSrc:                  /* TIMESRC*/
        BW_SIM_SOPT2_TIMESRC(setting);
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_RMIISRC
    case kSimClockRmiiSrc:                  /* RMIISRC*/
        BW_SIM_SOPT2_RMIISRC(setting);
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_USBSRC
    case kSimClockUsbSrc:                    /* USBSRC*/
        BW_SIM_SOPT2_USBSRC(setting);
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_USBFSRC
    case kSimClockUsbfSrc:                   /* USBFSRC*/
        BW_SIM_SOPT2_USBFSRC(setting);
        break;
    case kSimClockUsbfSel:                  /* USBF_CLKSEL*/
        BW_SIM_SOPT2_USBF_CLKSEL(setting);
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_USBHSRC
    case kSimClockUsbhSrc:                  /* USBHSRC*/
        BW_SIM_SOPT2_USBHSRC(setting);
        break;
#endif

