maoravni/Dev/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/fsl_sim_hal.c
#if FSL_FEATURE_SIM_OPT_HAS_UART0SRC
    case kSimClockUart0Src:                 /* UART0SRC*/
        BW_SIM_SOPT2_UART0SRC(setting);
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_TPMSRC
    case kSimClockTpmSrc:                   /* TPMSRC*/
        BW_SIM_SOPT2_TPMSRC(setting);
        break;
#endif

    case kSimClockOsc32kSel:                /* OSC32KSEL*/
        BW_SIM_SOPT1_OSC32KSEL(setting);
        break;

    case kSimClockPllfllSel:                /* PLLFLLSEL*/
        BW_SIM_SOPT2_PLLFLLSEL(setting);
        break;

#if FSL_FEATURE_SIM_OPT_HAS_TRACE_CLKSEL
    case kSimClockTraceSel:                 /* TRACE_CLKSEL*/
        BW_SIM_SOPT2_TRACECLKSEL(setting);
        break;
#endif

    case kSimClockClkoutSel:                /* CLKOUTSEL*/
        BW_SIM_SOPT2_CLKOUTSEL(setting);
        break;

    case kSimClockRtcClkoutSel:                /* RTCCLKOUTSEL*/
        BW_SIM_SOPT2_RTCCLKOUTSEL(setting);
        break;

    default:
        status = kSimHalNoSuchClockSrc;
        break;
    }

    return status;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : clock_hal_get_clock_source
 * Description   : Get clock source setting
 * This function will get the settings for specified clock source. Each clock 
 * source has its clock selection settings. Refer to reference manual for 
 * details of settings for each clock source. Refer to sim_clock_source_names_t
 * for clock sources.
 * 
 *END**************************************************************************/
sim_hal_status_t clock_hal_get_clock_source(sim_clock_source_names_t clockSource, uint8_t *setting)
{
    sim_hal_status_t status = kSimHalSuccess;
    assert(clockSource < kSimClockSourceMax);

    switch (clockSource)
    {
#if FSL_FEATURE_SIM_OPT_HAS_NFCSRC
    case kSimClockNfcSrc:                   /* NFCSRC*/
        *setting = BR_SIM_SOPT2_NFCSRC;
        break;
    case kSimClockNfcSel:                   /* NFC_CLKSEL*/
        *setting = BR_SIM_SOPT2_NFC_CLKSEL;
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_ESDHCSRC
    case kSimClockEsdhcSrc:                 /* ESDHCSRC*/
        *setting = BR_SIM_SOPT2_ESDHCSRC;
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_SDHCSRC
    case kSimClockSdhcSrc:                  /* SDHCSRC*/
        *setting = BR_SIM_SOPT2_SDHCSRC;
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_LCDCSRC
    case kSimClockLcdcSrc:                  /* LCDCSRC*/
        *setting = BR_SIM_SOPT2_LCDCSRC;
        break;
    case kSimClockLcdcSel:                  /* LCDC_CLKSEL*/
        *setting = BR_SIM_SOPT2_LCDC_CLKSEL;
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_TIMESRC
    case kSimClockTimeSrc:                  /* TIMESRC*/
        *setting = BR_SIM_SOPT2_TIMESRC;
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_RMIISRC
    case kSimClockRmiiSrc:                  /* RMIISRC*/
        *setting = BR_SIM_SOPT2_RMIISRC;
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_USBSRC
    case kSimClockUsbSrc:                    /* USBSRC*/
        *setting = BR_SIM_SOPT2_USBSRC;
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_USBFSRC
    case kSimClockUsbfSrc:                   /* USBFSRC*/
        *setting = BR_SIM_SOPT2_USBFSRC;
        break;
    case kSimClockUsbfSel:                  /* USBF_CLKSEL*/
        *setting = BR_SIM_SOPT2_USBF_CLKSEL;
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_USBHSRC
    case kSimClockUsbhSrc:                  /* USBHSRC*/
        *setting = BR_SIM_SOPT2_USBHSRC;
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_UART0SRC
    case kSimClockUart0Src:                 /* UART0SRC*/
        *setting = BR_SIM_SOPT2_UART0SRC;
        break;
#endif

#if FSL_FEATURE_SIM_OPT_HAS_TPMSRC
    case kSimClockTpmSrc:                   /* TPMSRC*/
        *setting = BR_SIM_SOPT2_TPMSRC;
        break;
#endif

    case kSimClockOsc32kSel:                /* OSC32KSEL*/
        *setting = BR_SIM_SOPT1_OSC32KSEL;
        break;

    case kSimClockPllfllSel:                /* PLLFLLSEL*/
        *setting = BR_SIM_SOPT2_PLLFLLSEL;
        break;

#if FSL_FEATURE_SIM_OPT_HAS_TRACE_CLKSEL
    case kSimClockTraceSel:                 /* TRACE_CLKSEL*/
        *setting = BR_SIM_SOPT2_TRACECLKSEL;
        break;
#endif

    case kSimClockClkoutSel:                /* CLKOUTSEL */
        *setting = BR_SIM_SOPT2_CLKOUTSEL;
        break;

    case kSimClockRtcClkoutSel:                /* RTCCLKOUTSEL */
        *setting = BR_SIM_SOPT2_RTCCLKOUTSEL;
        break;

    default:
        status = kSimHalNoSuchClockSrc;
        break;
    }

    return status;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : clock_hal_set_clock_divider
 * Description   : Set clock divider setting
 * This function will set the setting for specified clock divider. Refer to 
 * reference manual for supported clock divider and value range. Refer to 
 * sim_clock_divider_names_t for dividers.
 * 
 *END**************************************************************************/
sim_hal_status_t clock_hal_set_clock_divider(sim_clock_divider_names_t clockDivider, 
                                             uint32_t setting)
{
    sim_hal_status_t status = kSimHalSuccess;
    assert(clockDivider < kSimClockDividerMax);

    switch (clockDivider)
    {
    case kSimClockDividerOutdiv1:           /* OUTDIV1*/
        BW_SIM_CLKDIV1_OUTDIV1(setting);
        break;

#if FSL_FEATURE_SIM_DIVIDER_HAS_OUTDIV2
    case kSimClockDividerOutdiv2:           /* OUTDIV2*/
        BW_SIM_CLKDIV1_OUTDIV2(setting);
        break;
#endif

#if FSL_FEATURE_SIM_DIVIDER_HAS_OUTDIV3
    case kSimClockDividerOutdiv3:           /* OUTDIV3*/
        BW_SIM_CLKDIV1_OUTDIV3(setting);
        break;
#endif

    case kSimClockDividerOutdiv4:           /* OUTDIV4*/
        BW_SIM_CLKDIV1_OUTDIV4(setting);
        break;

#if FSL_FEATURE_SIM_DIVIDER_HAS_USBDIV
    case kSimClockDividerUsbFrac:           /* USBFRAC*/
        BW_SIM_CLKDIV2_USBFRAC(setting);
        break;
    case kSimClockDividerUsbDiv:            /* USBDIV*/
        BW_SIM_CLKDIV2_USBDIV(setting);
        break;
#endif

