maoravni/Dev/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/fsl_sim_hal.c
    switch (instance)
    {
    case 0:
        return BR_SIM_SOPT7_ADC0ALTTRGEN;
        break;
#if (HW_ADC_INSTANCE_COUNT > 1)
    case 1:
        return BR_SIM_SOPT7_ADC1ALTTRGEN;
        break;
#if (HW_ADC_INSTANCE_COUNT > 2)
    case 2:
        return BR_SIM_SOPT7_ADC2ALTTRGEN;
        break;
    case 3:
        return BR_SIM_SOPT7_ADC3ALTTRGEN;
        break;
#endif
#endif
    default:
        return false;
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sim_set_pretrgsel
 * Description   : Set ADCx pre-trigger select setting
 * This function will select the ADCx pre-trigger source when alternative
 * triggers are enabled through ADCxALTTRGEN
 * 
 *END**************************************************************************/
void sim_set_pretrgsel(uint8_t instance, sim_pretrgsel_t select)
{
    assert(instance < HW_ADC_INSTANCE_COUNT);

    switch (instance)
    {
    case 0:
        BW_SIM_SOPT7_ADC0PRETRGSEL(select);
        break;
#if (HW_ADC_INSTANCE_COUNT > 1)
    case 1:
        BW_SIM_SOPT7_ADC1PRETRGSEL(select);
        break;
#if (HW_ADC_INSTANCE_COUNT > 2)
    case 2:
        BW_SIM_SOPT7_ADC2PRETRGSEL(select);
        break;
    case 3:
        BW_SIM_SOPT7_ADC3PRETRGSEL(select);
        break;
#endif
#endif
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sim_get_pretrgsel
 * Description   : Get ADCx pre-trigger select setting
 * This function will get ADCx pre-trigger select setting.
 * 
 *END**************************************************************************/
sim_pretrgsel_t sim_get_pretrgsel(uint8_t instance)
{
    assert(instance < HW_ADC_INSTANCE_COUNT);

    switch (instance)
    {
    case 0:
        return (sim_pretrgsel_t)BR_SIM_SOPT7_ADC0PRETRGSEL;
        break;
#if (HW_ADC_INSTANCE_COUNT > 1)
    case 1:
        return (sim_pretrgsel_t)BR_SIM_SOPT7_ADC1PRETRGSEL;
        break;
#if (HW_ADC_INSTANCE_COUNT > 2)
    case 2:
        return (sim_pretrgsel_t)BR_SIM_SOPT7_ADC2PRETRGSEL;
        break;
    case 3:
        return (sim_pretrgsel_t)BR_SIM_SOPT7_ADC3PRETRGSEL;
        break;
#endif
#endif
    default:
        return false;
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sim_set_trgsel
 * Description   : Set ADCx trigger select setting
 * This function will select the ADCx trigger source when alternative triggers
 * are enabled through ADCxALTTRGEN
 * 
 *END**************************************************************************/
void sim_set_trgsel(uint8_t instance, sim_trgsel_t select)
{
    assert(instance < HW_ADC_INSTANCE_COUNT);

    switch (instance)
    {
    case 0:
        BW_SIM_SOPT7_ADC0TRGSEL(select);
        break;
#if (HW_ADC_INSTANCE_COUNT > 1)
    case 1:
        BW_SIM_SOPT7_ADC1TRGSEL(select);
        break;
#if (HW_ADC_INSTANCE_COUNT > 2)
    case 2:
        BW_SIM_SOPT7_ADC2TRGSEL(select);
        break;
    case 3:
        BW_SIM_SOPT7_ADC3TRGSEL(select);
        break;
#endif
#endif
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sim_get_trgsel
 * Description   : Get ADCx trigger select setting 
 * This function will get ADCx trigger select setting.
 * 
 *END**************************************************************************/
sim_pretrgsel_t sim_get_trgsel(uint8_t instance)
{
    assert(instance < HW_ADC_INSTANCE_COUNT);

    switch (instance)
    {
    case 0:
        return (sim_pretrgsel_t)BR_SIM_SOPT7_ADC0TRGSEL;
        break;
#if (HW_ADC_INSTANCE_COUNT > 1)
    case 1:
        return (sim_pretrgsel_t)BR_SIM_SOPT7_ADC1TRGSEL;
        break;
#if (HW_ADC_INSTANCE_COUNT > 2)
    case 2:
        return (sim_pretrgsel_t)BR_SIM_SOPT7_ADC2TRGSEL;
        break;
    case 3:
        return (sim_pretrgsel_t)BR_SIM_SOPT7_ADC3TRGSEL;
        break;
#endif
#endif
    default:
        return false;
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sim_set_uart_rxsrc
 * Description   : Set UARTx receive data source select setting 
 * This function will select the source for the UART1 receive data.
 * 
 *END**************************************************************************/
void sim_set_uart_rxsrc(uint8_t instance, sim_uart_rxsrc_t select)
{
    assert(instance < FSL_FEATURE_SIM_OPT_UART_COUNT);

    switch (instance)
    {
    case 0:
        BW_SIM_SOPT5_UART0RXSRC(select);
        break;
    case 1:
        BW_SIM_SOPT5_UART1RXSRC(select);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sim_get_pretrgsel
 * Description   : Get UARTx receive data source select setting 
 * This function will get UARTx receive data source select setting.
 * 
 *END**************************************************************************/
sim_uart_rxsrc_t sim_get_uart_rxsrc(uint8_t instance)
{
    assert(instance < FSL_FEATURE_SIM_OPT_UART_COUNT);

    switch (instance)
    {
    case 0:
        return (sim_uart_rxsrc_t)BR_SIM_SOPT5_UART0RXSRC;
        break;
    case 1:
        return (sim_uart_rxsrc_t)BR_SIM_SOPT5_UART1RXSRC;
        break;
    default:
        return (sim_uart_rxsrc_t)0;
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sim_set_uart_txsrc
 * Description   : Set UARTx transmit data source select setting 
 * This function will select the source for the UARTx transmit data.
 * 
 *END**************************************************************************/
void sim_set_uart_txsrc(uint8_t instance, sim_uart_txsrc_t select)
{
    assert(instance < FSL_FEATURE_SIM_OPT_UART_COUNT);

