maoravni/Dev/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/fsl_sim_hal.c
    switch (instance)
    {
    case 0:
        BW_SIM_SOPT5_UART0TXSRC(select);
        break;
    case 1:
        BW_SIM_SOPT5_UART1TXSRC(select);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sim_get_uart_txsrc
 * Description   : Get UARTx transmit data source select setting 
 * This function will get UARTx transmit data source select setting.
 * 
 *END**************************************************************************/
sim_uart_txsrc_t sim_get_uart_txsrc(uint8_t instance)
{
    assert(instance < FSL_FEATURE_SIM_OPT_UART_COUNT);

    switch (instance)
    {
    case 0:
        return (sim_uart_txsrc_t)BR_SIM_SOPT5_UART0TXSRC;
        break;
    case 1:
        return (sim_uart_txsrc_t)BR_SIM_SOPT5_UART1TXSRC;
        break;
    default:
        return (sim_uart_txsrc_t)0;
        break;
    }
}

#if FSL_FEATURE_SIM_OPT_HAS_ODE
/*FUNCTION**********************************************************************
 *
 * Function Name : sim_set_uart_ode
 * Description   : Set UARTx Open Drain Enable setting 
 * This function will enable/disable the UARTx Open Drain.
 * 
 *END**************************************************************************/
void sim_set_uart_ode(uint8_t instance, bool enable)
{
    assert(instance < FSL_FEATURE_SIM_OPT_UART_COUNT);

    switch (instance)
    {
    case 0:
        BW_SIM_SOPT5_UART0ODE(enable ? 1 : 0);
        break;
    case 1:
        BW_SIM_SOPT5_UART1ODE(enable ? 1 : 0);
        break;
    case 2:
        BW_SIM_SOPT5_UART2ODE(enable ? 1 : 0);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sim_get_uart_ode
 * Description   : Get UARTx Open Drain Enable setting 
 * This function will get UARTx Open Drain Enable setting.
 * 
 *END**************************************************************************/
bool sim_get_uart_ode(uint8_t instance)
{
    assert(instance < FSL_FEATURE_SIM_OPT_UART_COUNT);

    switch (instance)
    {
    case 0:
        return BR_SIM_SOPT5_UART0ODE;
        break;
    case 1:
        return BR_SIM_SOPT5_UART1ODE;
        break;
    case 2:
        return BR_SIM_SOPT5_UART2ODE;
        break;
    default:
        return (sim_uart_txsrc_t)0;
        break;
    }
}
#endif

#if FSL_FEATURE_SIM_OPT_HAS_FTM
/*FUNCTION**********************************************************************
 *
 * Function Name : sim_set_ftm_trg_src
 * Description   : Set FlexTimer x hardware trigger y source select setting 
 * This function will select the source of FTMx hardware trigger y.
 * 
 *END**************************************************************************/
void sim_set_ftm_trg_src(uint8_t instance, uint8_t trigger, sim_ftm_trg_src_t select)
{
    assert (instance < HW_FTM_INSTANCE_COUNT);
    assert (trigger < FSL_FEATURE_SIM_OPT_FTM_TRIGGER_COUNT);

    switch (instance)
    {
#if FSL_FEATURE_SIM_OPT_HAS_FTM0_TRIGGER
    case 0:
        switch (trigger)
        {
        case 0:
            BW_SIM_SOPT4_FTM0TRG0SRC(select);
            break;
        case 1:
            BW_SIM_SOPT4_FTM0TRG1SRC(select);
            break;
        default:
            break;
        }
        break;
#endif
#if FSL_FEATURE_SIM_OPT_HAS_FTM3_TRIGGER
    case 3:
        switch (trigger)
        {
        case 0:
            BW_SIM_SOPT4_FTM3TRG0SRC(select);
            break;
        case 1:
            BW_SIM_SOPT4_FTM3TRG1SRC(select);
            break;
        default:
            break;
        }
        break;
#endif
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sim_get_ftm_trg_src
 * Description   : Get FlexTimer x hardware trigger y source select setting
 * This function will get FlexTimer x hardware trigger y source select setting.
 * 
 *END**************************************************************************/
sim_ftm_trg_src_t sim_get_ftm_trg_src(uint8_t instance, uint8_t trigger)
{
    assert (instance < HW_FTM_INSTANCE_COUNT);
    assert (trigger < FSL_FEATURE_SIM_OPT_FTM_TRIGGER_COUNT);

    switch (instance)
    {
#if FSL_FEATURE_SIM_OPT_HAS_FTM0_TRIGGER
    case 0:
        switch (trigger)
        {
        case 0:
            return (sim_ftm_trg_src_t)BR_SIM_SOPT4_FTM0TRG0SRC;
            break;
        case 1:
            return (sim_ftm_trg_src_t)BR_SIM_SOPT4_FTM0TRG1SRC;
            break;
        default:
            break;
        }
        break;
#endif
#if FSL_FEATURE_SIM_OPT_HAS_FTM3_TRIGGER
    case 3:
        switch (trigger)
        {
        case 0:
            return (sim_ftm_trg_src_t)BR_SIM_SOPT4_FTM3TRG0SRC;
            break;
        case 1:
            return (sim_ftm_trg_src_t)BR_SIM_SOPT4_FTM3TRG1SRC;
            break;
        default:
            break;
        }
        break;
#endif
    default:
        break;
    }

    return (sim_ftm_trg_src_t)0;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sim_set_ftm_clk_sel
 * Description   : Set FlexTimer x external clock pin select setting 
 * This function will select the source of FTMx external clock pin select
 * 
 *END**************************************************************************/
void sim_set_ftm_clk_sel(uint8_t instance, sim_ftm_clk_sel_t select)
{
    assert (instance < HW_FTM_INSTANCE_COUNT);

    switch (instance)
    {
    case 0:
        BW_SIM_SOPT4_FTM0CLKSEL(select);
        break;
    case 1:
        BW_SIM_SOPT4_FTM1CLKSEL(select);
        break;
    case 2:
        BW_SIM_SOPT4_FTM2CLKSEL(select);
        break;
    case 3:
        BW_SIM_SOPT4_FTM3CLKSEL(select);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sim_get_ftm_clk_sel
 * Description   : Get FlexTimer x external clock pin select setting
 * This function will get FlexTimer x external clock pin select setting.
 * 
 *END**************************************************************************/
sim_ftm_clk_sel_t sim_get_ftm_clk_sel(uint8_t instance)
{
    assert (instance < HW_FTM_INSTANCE_COUNT);

