maoravni/Dev/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/fsl_sim_hal.c
    switch (instance)
    {
    case 0:
        return (sim_ftm_clk_sel_t)BR_SIM_SOPT4_FTM0CLKSEL;
        break;
    case 1:
        return (sim_ftm_clk_sel_t)BR_SIM_SOPT4_FTM1CLKSEL;
        break;
    case 2:
        return (sim_ftm_clk_sel_t)BR_SIM_SOPT4_FTM2CLKSEL;
        break;
    case 3:
        return (sim_ftm_clk_sel_t)BR_SIM_SOPT4_FTM3CLKSEL;
        break;
    default:
        break;
    }

    return (sim_ftm_clk_sel_t)0;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sim_set_ftm_ch_src
 * Description   : FlexTimer x channel y input capture source select setting 
 * This function will select FlexTimer x channel y input capture source
 * 
 *END**************************************************************************/
void sim_set_ftm_ch_src(uint8_t instance, uint8_t channel, sim_ftm_ch_src_t select)
{
    assert (instance < HW_FTM_INSTANCE_COUNT);

    switch (instance)
    {
#if FSL_FEATURE_SIM_OPT_HAS_FTM1_CHANNELS
    case 1:
        switch (channel)
        {
        case 0:
            BW_SIM_SOPT4_FTM1CH0SRC(select);
            break;
        default:
            break;
        }
        break;
#endif
#if FSL_FEATURE_SIM_OPT_HAS_FTM2_CHANNELS
    case 2:
        switch (channel)
        {
        case 0:
            BW_SIM_SOPT4_FTM2CH0SRC(select);
            break;
#if FSL_FEATURE_SIM_OPT_HAS_FTM2_CHANNEL1
        case 1:
            BW_SIM_SOPT4_FTM2CH1SRC(select);
            break;
#endif
        default:
            break;
        }
        break;
#endif
#if FSL_FEATURE_SIM_OPT_HAS_FTM3_CHANNELS
    case 3:
        switch (channel)
        {
        case 0:
            BW_SIM_SOPT4_FTM3CH0SRC(select);
            break;
        default:
            break;
        }
        break;
#endif
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sim_get_ftm_ch_src
 * Description   : Get FlexTimer x channel y input capture source select setting
 * This function will get FlexTimer x channel y input capture source select 
 * setting.
 * 
 *END**************************************************************************/
sim_ftm_ch_src_t sim_get_ftm_ch_src(uint8_t instance, uint8_t channel)
{
    assert (instance < HW_FTM_INSTANCE_COUNT);

    switch (instance)
    {
#if FSL_FEATURE_SIM_OPT_HAS_FTM1_CHANNELS
    case 1:
        switch (channel)
        {
        case 0:
            return (sim_ftm_ch_src_t)BR_SIM_SOPT4_FTM1CH0SRC;
            break;
        default:
            break;
        }
        break;
#endif
#if FSL_FEATURE_SIM_OPT_HAS_FTM2_CHANNELS
    case 2:
        switch (channel)
        {
        case 0:
            return (sim_ftm_ch_src_t)BR_SIM_SOPT4_FTM2CH0SRC;
            break;
#if FSL_FEATURE_SIM_OPT_HAS_FTM2_CHANNEL1
        case 1:
            return (sim_ftm_ch_src_t)BR_SIM_SOPT4_FTM2CH1SRC;
            break;
#endif
        default:
            break;
        }
        break;
#endif
#if FSL_FEATURE_SIM_OPT_HAS_FTM3_CHANNELS
    case 3:
        switch (channel)
        {
        case 0:
            return (sim_ftm_ch_src_t)BR_SIM_SOPT4_FTM3CH0SRC;
            break;
        default:
            break;
        }
        break;
#endif
    default:
        break;
    }

    return (sim_ftm_ch_src_t)0;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sim_set_ftm_flt_sel
 * Description   : Set FlexTimer x fault y select setting 
 * This function will set the FlexTimer x fault y select setting.
 * 
 *END**************************************************************************/
void sim_set_ftm_flt_sel(uint8_t instance, uint8_t fault, sim_ftm_flt_sel_t select)
{
    assert (instance < HW_FTM_INSTANCE_COUNT);

    switch (instance)
    {
    case 0:
        switch (fault)
        {
        case 0:
            BW_SIM_SOPT4_FTM0FLT0(select);
            break;
        case 1:
            BW_SIM_SOPT4_FTM0FLT1(select);
            break;
#if (FSL_FEATURE_SIM_OPT_FTM0_FAULT_COUNT > 2)
        case 2:
            BW_SIM_SOPT4_FTM0FLT2(select);
            break;
#if (FSL_FEATURE_SIM_OPT_FTM0_FAULT_COUNT > 3)
        case 3:
            BW_SIM_SOPT4_FTM0FLT3(select);
            break;
#endif
#endif
        default:
            break;
        }
        break;
    case 1:
        BW_SIM_SOPT4_FTM1FLT0(select);
        break;
    case 2:
        BW_SIM_SOPT4_FTM2FLT0(select);
        break;
    case 3:
        BW_SIM_SOPT4_FTM3FLT0(select);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sim_get_ftm_flt_sel
 * Description   : Get FlexTimer x fault y select setting
 * This function will get FlexTimer x fault y select setting.
 * 
 *END**************************************************************************/
sim_ftm_flt_sel_t sim_get_ftm_flt_sel(uint8_t instance, uint8_t fault)
{
    assert (instance < HW_FTM_INSTANCE_COUNT);

    switch (instance)
    {
    case 0:
        switch (fault)
        {
        case 0:
            return (sim_ftm_flt_sel_t)BR_SIM_SOPT4_FTM0FLT0;
            break;
        case 1:
            return (sim_ftm_flt_sel_t)BR_SIM_SOPT4_FTM0FLT1;
            break;
#if (FSL_FEATURE_SIM_OPT_FTM0_FAULT_COUNT > 2)
        case 2:
            return (sim_ftm_flt_sel_t)BR_SIM_SOPT4_FTM0FLT2;
            break;
#if (FSL_FEATURE_SIM_OPT_FTM0_FAULT_COUNT > 3)
        case 3:
            return (sim_ftm_flt_sel_t)BR_SIM_SOPT4_FTM0FLT3;
            break;
#endif
#endif
        default:
            break;
        }
        break;
    case 1:
        return (sim_ftm_flt_sel_t)BR_SIM_SOPT4_FTM1FLT0;
        break;
    case 2:
        return (sim_ftm_flt_sel_t)BR_SIM_SOPT4_FTM2FLT0;
        break;
    case 3:
        return (sim_ftm_flt_sel_t)BR_SIM_SOPT4_FTM3FLT0;
        break;
    default:
        break;
    }

    return (sim_ftm_flt_sel_t)0;
}
#endif

#if FSL_FEATURE_SIM_OPT_HAS_TPM
/*FUNCTION**********************************************************************
 *
 * Function Name : sim_set_tpm_clk_sel
 * Description   : Set Timer/PWM x external clock pin select setting 
 * This function will select the source of Timer/PWM x external clock pin select
 * 
 *END**************************************************************************/
void sim_set_tpm_clk_sel(uint8_t instance, sim_tpm_clk_sel_t select)
{
    assert (instance < HW_TPM_INSTANCE_COUNT);

