maoravni/Dev/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/fsl_sim_hal.c
    switch (instance)
    {
    case 0:
        BW_SIM_SOPT4_TPM0CLKSEL(select);
        break;
    case 1:
        BW_SIM_SOPT4_TPM1CLKSEL(select);
        break;
    case 2:
        BW_SIM_SOPT4_TPM2CLKSEL(select);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sim_get_tpm_clk_sel
 * Description   : Get Timer/PWM x external clock pin select setting
 * This function will get Timer/PWM x external clock pin select setting.
 * 
 *END**************************************************************************/
sim_tpm_clk_sel_t sim_get_tpm_clk_sel(uint8_t instance)
{
    assert (instance < HW_TPM_INSTANCE_COUNT);

    switch (instance)
    {
    case 0:
        return (sim_tpm_clk_sel_t)BR_SIM_SOPT4_TPM0CLKSEL;
        break;
    case 1:
        return (sim_tpm_clk_sel_t)BR_SIM_SOPT4_TPM1CLKSEL;
        break;
    case 2:
        return (sim_tpm_clk_sel_t)BR_SIM_SOPT4_TPM2CLKSEL;
        break;
    default:
        break;
    }

    return (sim_tpm_clk_sel_t)0;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sim_set_tpm_ch_src
 * Description   : Timer/PWM x channel y input capture source select setting 
 * This function will select Timer/PWM x channel y input capture source
 * 
 *END**************************************************************************/
void sim_set_tpm_ch_src(uint8_t instance, uint8_t channel, sim_tpm_ch_src_t select)
{
    assert (instance < HW_TPM_INSTANCE_COUNT);

    switch (instance)
    {
    case 1:
        switch (channel)
        {
        case 0:
            BW_SIM_SOPT4_TPM1CH0SRC(select);
            break;
        default:
            break;
        }
        break;
    case 2:
        switch (channel)
        {
        case 0:
            BW_SIM_SOPT4_TPM2CH0SRC(select);
            break;
        default:
            break;
        }
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : sim_get_tpm_ch_src
 * Description   : Get Timer/PWM x channel y input capture source select setting
 * This function will get Timer/PWM x channel y input capture source select 
 * setting.
 * 
 *END**************************************************************************/
sim_tpm_ch_src_t sim_get_tpm_ch_src(uint8_t instance, uint8_t channel)
{
    assert (instance < HW_TPM_INSTANCE_COUNT);

    switch (instance)
    {
    case 1:
        switch (channel)
        {
        case 0:
            return (sim_tpm_ch_src_t)BR_SIM_SOPT4_TPM1CH0SRC;
            break;
        default:
            break;
        }
        break;
    case 2:
        switch (channel)
        {
        case 0:
            return (sim_tpm_ch_src_t)BR_SIM_SOPT4_TPM2CH0SRC;
            break;
        default:
            break;
        }
        break;
    default:
        break;
    }

    return (sim_tpm_ch_src_t)0;
}
#endif

/*******************************************************************************
 * EOF
 ******************************************************************************/

